src/DataProcessors/ВыгрузкаДанныхДляНСИ/ВыгрузкаДанныхДляНСИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыгрузкаДанныхДляНСИ</name>
</mdclass:DataProcessor>

src/Catalogs/УчетныеЗаписиЭлектроннойПочты/УчетныеЗаписиЭлектроннойПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеЗаписиЭлектроннойПочты</name>
  <predefined>
    <items>
      <name>ОбменСНСИ</name>
      <description>Обмен с НСИ</description>
    </items>
    <items>
      <name>СистемнаяУчетнаяЗаписьЭлектроннойПочты</name>
      <description>Системная учетная запись</description>
    </items>
  </predefined>
  <attributes>
    <name>SMTPАутентификация</name>
    <type>
      <types>EnumRef.ВариантыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресЭлектроннойПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОжидания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователя</name>
    <comment>Имя отправителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьБезопасныйВходНаСерверИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляОтправки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляПолучения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляВходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединениеДляИсходящейПочты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОставлятьКопииСообщенийНаСервере</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодХраненияСообщенийНаСервере</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераВходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераИсходящейПочты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПротоколВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверВходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверИсходящейПочты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособPOP3Аутентификации</name>
    <type>
      <types>EnumRef.СпособыPOP3Аутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособSMTPАутентификации</name>
    <type>
      <types>EnumRef.СпособыSMTPАутентификации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВходНаСерверПередОтправкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВПредставлениеВключатьИмяПользователя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьОтветственныйЗаОбработкуПисем</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПарольSMTP</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СтруктураЗаказаПоКомплектующимИзделиямИЗИП/СтруктураЗаказаПоКомплектующимИзделиямИЗИП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтруктураЗаказаПоКомплектующимИзделиямИЗИП</name>
  <comment>Электронная структура комплектующих изделий и ЗИП корабля</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <owners>Catalog.Заказы</owners>
  <attributes>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыУзловЭлектроннойСтруктурыКомплектующихИзделийИЗИПКорабля</types>
    </type>
  </attributes>
  <attributes>
    <name>Заведование</name>
    <type>
      <types>CatalogRef.БоевыеЧасти</types>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <comment>Используется для элементов с типом &quot;Группа изделий&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредметСнабжения</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>CatalogRef.КаталогПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <comment>Используется для элементов с типами &quot;Изделие&quot; и &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБорт</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПБаза</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПДЭ</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВЗИПР</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДобавленИзСпецификации</name>
    <comment>Используется для элементов с типом &quot;ЗИП&quot;. Значение Истина означает программное создание при обработке изменений спецификации предмета снабжения</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСоставляющейЧасти</name>
    <type>
      <types>CatalogRef.РазделыСпецификацииЗИП</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПозицииСпецификации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗИП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеДоп</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.Помещения</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьПодчиненные</name>
    <comment>признак того, что элемент является родителем</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/DataProcessors/ВыгрузкаДанныхДляНСИ/Forms/Форма/Module.bsl
&НаСервере
Функция ОтправитьНаПочту(АдресФайла = "", АдресПочтыКонтрагента = "", ТекстОшибки="")
	
	Если АдресФайла = "" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	Если АдресПочтыКонтрагента = "" Тогда
		Возврат Ложь;
	КонецЕсли; 
	
	ДанныеХранилища = ПолучитьИзВременногоХранилища(АдресФайла);

	ФайлАрхив = КаталогВременныхФайлов() + "Respond.zip";
	Архив = Новый ЗаписьZipФайла(ФайлАрхив);
	Архив.Добавить(ДанныеХранилища);
	Архив.Записать();

	Вложения = Новый Соответствие;
	Вложения.Вставить("Respond.zip", ФайлАрхив);
	
	ПараметрыСообщения = Новый Структура;
	ПараметрыСообщения.Вставить("Кому", АдресПочтыКонтрагента);
	ПараметрыСообщения.Вставить("Тема", "Ответ");
	ПараметрыСообщения.Вставить("Вложения", Вложения);
	
	Попытка
		РаботаСПочтовымиСообщениями.ОтправитьПочтовоеСообщение(Справочники.УчетныеЗаписиЭлектроннойПочты.СистемнаяУчетнаяЗаписьЭлектроннойПочты, ПараметрыСообщения);
		Рез = Истина;
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Рез = Ложь;
	КонецПопытки;
	
	УдалитьФайлы(ДанныеХранилища);
	УдалитьФайлы(ФайлАрхив);
	
	Возврат Рез; 
	
КонецФункции

&НаСервереБезКонтекста
Процедура ЗаписатьЭлементХМЛ(ЗаписьХМЛ, Имя, Значение)
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента(Имя);
	ЗаписьХМЛ.ЗаписатьТекст(Значение);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // Version
		
КонецПроцедуры 

// Возвращает текстовый хмл с данными по кораблю
//
&НаСервере
Функция ВыгрузитьДанныеПоКораблюВФайл(Корабль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения КАК Ссылка
	|ПОМЕСТИТЬ ПС_Различные
	|ИЗ
	|	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|ГДЕ
	|	НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	|	И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПС_Различные.Ссылка КАК Наименование,
	|	ПС_Различные.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	КаталогПредметовСнабженияХарактеристики.Характеристика КАК Характеристика,
	|	КаталогПредметовСнабженияХарактеристики.Значение КАК Значение,
	|	КаталогПредметовСнабженияХарактеристики.ЕдиницаИзмерения КАК ЕдиницаИзмеренияХар
	|ИЗ
	|	ПС_Различные КАК ПС_Различные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КаталогПредметовСнабжения.Характеристики КАК КаталогПредметовСнабженияХарактеристики
	|		ПО ПС_Различные.Ссылка = КаталогПредметовСнабженияХарактеристики.Ссылка
	|ИТОГИ ПО
	|	Наименование";
	Запрос.УстановитьПараметр("Владелец", Корабль);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Версия = "1.00";
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку("UTF-8");
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfRequests");
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Request");
	
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Version", 		Версия);
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Type", 			ТипЗапроса);
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "RequestAbonent", КодАбонента);
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfItems");
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Item");
		
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name", 			Строка(Выборка.Наименование));
		
		Характеристики = Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Если Характеристики.Количество() > 0 Тогда
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfCharacteristics");
			Пока Характеристики.Следующий() Цикл
				
				ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Characteristic");
				
				ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name",  Строка(Характеристики.Характеристика));
				ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Value", XMLСтрока(Характеристики.Значение));
				ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Unit",  Строка(Характеристики.ЕдиницаИзмеренияХар));
				
				ЗаписьХМЛ.ЗаписатьКонецЭлемента();
				
			КонецЦикла; 
			ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		КонецЕсли; 
		
		ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		
	КонецЦикла; 
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьХМЛ.Закрыть();
	
КонецФункции
 
&НаСервере
Процедура ВыгрузитьИОтправитьНаСервере()
	
	Если НЕ АдресПолучателя = "" Тогда
		
		ТекстХМЛ = ВыгрузитьДанныеПоКораблюВФайл(Корабль);
		
		ФайлХМЛ = КаталогВременныхФайлов() + "Request.xml";
		Запись = Новый ЗаписьXML;
		Запись.ОткрытьФайл(ФайлХМЛ);
		Запись.ЗаписатьТекст(ТекстХМЛ);
		Запись.Закрыть();
		
		АдресФайла = ПоместитьВоВременноеХранилище(ФайлХМЛ);		
		
		ТекстОшибки = "";
		Если НЕ ОтправитьНаПочту(АдресФайла, АдресПолучателя, ТекстОшибки) Тогда
			Сообщить(ТекстОшибки);
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИОтправить(Команда)
	
	ВыгрузитьИОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТипЗапроса  = "ЗапросНаКлассификацию";
	КодАбонента = "170607";
	//АдресПолучателя = "mdm_admin@seaproject.ru"; 
	АдресПолучателя = "";
	
	Сервер		 = "sp-1c";
	БазаДанных   = "osk_mdm_bd";
	Пользователь = "Администратор";
	Пароль       = "";
	
КонецПроцедуры

&НаСервере
Процедура ВыгрузитьИСохранитьНаСервере(АдресФайла = "")
	
	АдресФайла = ПоместитьВоВременноеХранилище(ВыгрузитьДанныеПоКораблюВФайл(Корабль));		
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИСохранить(Команда)
	
	АдресФайла = "";
	
	ВыгрузитьИСохранитьНаСервере(АдресФайла);
	
	Если НЕ АдресФайла = "" И НЕ ПутьКФайлу = "" Тогда
		
		ЗаписьXMLСтрока = ПолучитьИзВременногоХранилища(АдресФайла);
		
		Текст= Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(ЗаписьXMLСтрока);
		Текст.Записать(ПутьКФайлу);
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.ПолноеИмяФайла = ПутьКФайлу;
	Диалог.Фильтр = "xml|*.xml";
	Диалог.МножественныйВыбор = Ложь;
	
    Диалог.Показать(Новый ОписаниеОповещения("ОбработкаВыборафайла", ЭтотОбъект));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыборафайла(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
    
	Если ВыбранныеФайлы <> Неопределено И ВыбранныеФайлы.Количество() > 0 Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
    КонецЕсли;
    
КонецПроцедуры

// Формат НСИ наш
&НаСервере
Функция ВыгрузитьДанныеПоКораблюВФайлПоПроекту(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения КАК Ссылка
	|ПОМЕСТИТЬ ПС_Различные
	|ИЗ
	|	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|ГДЕ
	|	НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	|	И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец.Владелец = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПС_Различные.Ссылка КАК Ссылка,
	|	ПС_Различные.Ссылка.Наименование КАК Наименование,
	|	ПС_Различные.Ссылка.ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	ПС_Различные КАК ПС_Различные
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Версия = "1.00";
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку("UTF-8");
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfRequests");
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Request");
	
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Version", 		Версия);
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Type", 			ТипЗапроса);
	ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "RequestAbonent", КодАбонента);
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfItems");
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Item");
		
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name", Строка(Выборка.Наименование));
		
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfCharacteristics");
		Для каждого Хар Из Выборка.Ссылка.Характеристики Цикл
			
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Characteristic");
			
			ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name",  Строка(Хар.Характеристика));
			ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Value", XMLСтрока(Хар.Значение));
			ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Unit",  Строка(Хар.ЕдиницаИзмеренияХар));
			
			ЗаписьХМЛ.ЗаписатьКонецЭлемента();
			
		КонецЦикла; 
		ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		
		ЗаписьХМЛ.ЗаписатьКонецЭлемента();
		
	КонецЦикла; 
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	ЗаписьХМЛ.ЗаписатьКонецЭлемента();
	
	Возврат ЗаписьХМЛ.Закрыть();
	
КонецФункции

// Формат Акселот
&НаСервере
Функция ВыгрузитьДанныеПоКораблюВФайлПоПроектуАкселот(Проект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПредметСнабжения КАК Ссылка
	|ПОМЕСТИТЬ ПС_Различные
	|ИЗ
	|	Справочник.СтруктураЗаказаПоКомплектующимИзделиямИЗИП КАК СтруктураЗаказаПоКомплектующимИзделиямИЗИП
	|ГДЕ
	|	НЕ СтруктураЗаказаПоКомплектующимИзделиямИЗИП.ПометкаУдаления
	|	И СтруктураЗаказаПоКомплектующимИзделиямИЗИП.Владелец.Владелец = &Проект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПС_Различные.Ссылка.Код КАК Код,
	|	ПС_Различные.Ссылка КАК Ссылка,
	|	ПС_Различные.Ссылка.Наименование КАК Наименование,
	|	ПС_Различные.Ссылка.Характеристики.(
	|		Характеристика КАК Характеристика,
	|		Значение КАК Значение,
	|		ЕдиницаИзмерения КАК ЕдиницаИзмерения
	|	) КАК Характеристики
	|ИЗ
	|	ПС_Различные КАК ПС_Различные
	|ИТОГИ ПО
	|	Ссылка";
	Запрос.УстановитьПараметр("Проект", Проект);
	
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Версия = "1.00";
	
	ЗаписьХМЛ = Новый ЗаписьXML;
	ЗаписьХМЛ.УстановитьСтроку("UTF-8");
	ЗаписьХМЛ.ЗаписатьОбъявлениеXML();
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("RequestMessage");
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("MessageInfo");
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Type", 			ТипЗапроса);
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "AbonentId", КодАбонента);
	ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // MessageInfo
	
	ЗаписьХМЛ.ЗаписатьНачалоЭлемента("MessageData");
	
	Пока Выборка.Следующий() Цикл
		
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Request");
		
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Code", Строка(Выборка.Код));
		ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name", Строка(Выборка.Наименование));
		
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfProperties");
		ВыборкаХар = Выборка.Характеристики.Выбрать();
		Пока ВыборкаХар.Следующий() Цикл
			
			ЗаписьХМЛ.ЗаписатьНачалоЭлемента("Property");
			ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Name",  Строка(ВыборкаХар.Характеристика));
			ЗаписатьЭлементХМЛ(ЗаписьХМЛ, "Value", XMLСтрока(ВыборкаХар.Значение));
			ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // Property
			
		КонецЦикла; 
		ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // ArrayOfProperties
			
		ЗаписьХМЛ.ЗаписатьНачалоЭлемента("ArrayOfFilesInfo");
		ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // ArrayOfFilesInfo
		
		ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // Request
		
	КонецЦикла; 
	
	ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // MessageData
	ЗаписьХМЛ.ЗаписатьКонецЭлемента(); // RequestMessage
	
	Возврат ЗаписьХМЛ.Закрыть();
	
КонецФункции

&НаСервере
Процедура ВыгрузитьВНСИНаСервере()
	
	V8 = Новый COMОбъект("V83.COMConnector");   
	
	СтрокаСоединения =  "srvr='" + Сервер + "'; ref='" + БазаДанных + "'; usr='" + Пользователь + "'; pwd='" + Пароль + "';";
	
	Попытка     
		Соединение = V8.Connect(СтрокаСоединения);          
	Исключение
		аа = ОписаниеОшибки();
	КонецПопытки;    
	
	ТекстХМЛ = ВыгрузитьДанныеПоКораблюВФайлПоПроектуАкселот(Проект);
	АдресСырыхДанных = Соединение.ПоместитьВоВременноеХранилище(ТекстХМЛ);
	
	Запись = Соединение.NewObject("Структура");
	//Запись = Новый Структура;
	Запись.Вставить("Дата", Дата(0001,01,01));
	Запись.Вставить("ИД", Неопределено);
	Запись.Вставить("Автор", "");
	Запись.Вставить("ДополнительныеСвойства", "");
	Запись.Вставить("Источник", "ЗИП-Э");
	Запись.Вставить("КлючНабора", "");
	
	// ЗАписываем сырые данные в регистр
	ДанныеЗаписи = Соединение.нсиСырыеДанные.ЗаписатьСырыеДанные(АдресСырыхДанных, Запись, Соединение.Перечисления.нсиСостояниеОбработкиСырыхДанных.Новое); 	
	
	Если НЕ ДанныеЗаписи = Неопределено Тогда
		Сообщить("Успешно");
	КонецЕсли;
	
	Соединение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВНСИ(Команда)
	ВыгрузитьВНСИНаСервере();
КонецПроцедуры
